Repository: AntonZab/zxtune
Catalog: l10n/*/core.po
Languages: ru

source: %1% processing
ru: Анализ %1%

source: %1% processing at %2%
ru: Анализ %1% в %2%

source: %1% processing for %2%
ru: Анализ %1% для %2%

source: %1% processing for %2% at %3%
ru: Анализ %1% для %2% в %3%

source: Specified minimal scan size (%1%). Should be more than %2%.
ru: Неправильный минимальный размер блока для анализа (%1%). Должен быть больше %2%.

source: Invalid parameters specified.
ru: Неправильные параметры.

source: Failed to find specified submodule starting from path '%1%'.
ru: Модуль не найден при поиске начиная с '%1%'.

source: Failed to allocate memory while processing modules.
ru: Ошибка выделения памяти при работе с модулями

source: Failed to convert to PSG format.
ru: Ошибка конверсии в PSG.

source: Failed to convert to ZX50 format.
ru: Ошибка конверсии в ZX50.

source: Failed to convert to debug ay format.
ru: Ошибка конверсии в отладочный формат.

source: Failed to convert to raw ay dump.
ru: Ошибка конверсии в сырой дамп регистров.

source: Failed to convert to FYM format.
ru: Ошибка конверсии в FYM.

source: Unsupported conversion mode (%1$08x).
ru: Неподдерживаемый режим конверсии (%1$08x).

source: Invalid duty cycle mask item: '%1%'.
ru: Неправильное значение канала для задания скважности: '%1%'.

source: Invalid layout value (%1%).
ru: Неправильное значение раскладки каналов (%1%).

source: Invalid clock frequency (%1%).
ru: Неправильное значение тактовой частоты (%1%).

source: Invalid duty cycle value (%1%).
ru: Неправильное значение скважности (%1%).

source: Invalid frequency table size (%1%).
ru: Неправильный размер частотной таблицы (%1%).

source: Invalid frequency table '%1%'.
ru: Неправильное значение частотной таблицы '%1%'.
