Repository: AntonZab/zxtune
Catalog: l10n/*/sound.po
Languages: ru

source: Error in ALSA backend: %1%.
ru: Ошибка в подсистеме ALSA: %1%.

source: Error in ALSA backend while working with device '%1%': %2%.
ru: Ошибка при работе с ALSA устройством '%1%': %2%.

source: No suitable formats supported by ALSA.
ru: Ни один подходящий формат вывода звука не поддерживается подсистемой ALSA.

source: Failed to found mixer '%1%' for ALSA backend.
ru: Микшер '%1%' не найден в подсистеме ALSA.

source: Failed to set volume: gain is out of range.
ru: Ошибка установки громкости: превышение допустимого значения.

source: ALSA backend error: buffers count (%1%) is out of range (%2%..%3%).
ru: Ошибка в подсистеме ALSA: число буферов (%1%) превысило допустимые значения (%2%..%3%).

source: ALSA sound system backend
ru: Поддержка подсистемы ALSA

source: Failed to create backend '%1%'.
ru: Ошибка создания подсистемы вывода '%1%'.

source: No suitable output devices found
ru: Не найдено ни одного подходящего устройства.

source: Invalid module specified for backend.
ru: Неправильный модуль.

source: Failed to initialize playback.
ru: Ошибка инициализации воспроизведения.

source: Failed to finalize playback.
ru: Ошибка завершения воспроизведения.

source: Failed to pause playback.
ru: Ошибка приостановки воспроизведения.

source: Failed to resume playback.
ru: Ошибка возобновления воспроизведения.

source: Failed to stop playback.
ru: Ошибка останова воспроизведения.

source: Failed to set playback position.
ru: Ошибка позиционирования воспроизведения.

source: Error in DirectSound backend: %1%.
ru: Ошибка в подсистеме DirectSound: %1%.

source: DirectSound backend error: latency (%1%) is out of range (%2%..%3%).
ru: Ошибка в подсистеме DirectSound: задержка звука (%1%) превышает допустимые значения (%2%..%3%).

source: DirectSound support backend.
ru: Поддержка подсистемы DirectSound

source: Requested backend is not supported.
ru: Запрашиваемая подсистема вывода звука не поддерживается.

source: Not supported in current configuration
ru: Не поддерживается в текущей конфигурации.

source: Output filename template is not specified.
ru: Шаблон имени результирующего файла не задан.

source: Error in FLAC backend.
ru: Ошибка в подсистеме вывода FLAC.

source: Error in FLAC backend (code %1%).
ru: Ошибка в подсистеме вывода FLAC: код %1%.

source: FLAC support backend.
ru: Поддержка вывода FLAC

source: Error in MP3 backend: %1%.
ru: Ошибка в подсистеме вывода MP3: %1%.

source: MP3 backend error: invalid bitrate mode '%1%'.
ru: Ошибка в подсистеме вывода MP3: неправильный режим битрейта '%1%'.

source: MP3 backend error: bitrate (%1%) is out of range (%2%..%3%).
ru: Ошибка в подсистеме вывода MP3: битрейт (%1%) превышает допустимые значения (%2%..%3%).

source: MP3 backend error: quality (%1%) is out of range (%2%..%3%).
ru: Ошибка в подсистеме вывода MP3: уровень качества (%1%) превышает допустимые значения (%2%..%3%).

source: MP3 backend error: invalid channels mode '%1%'.
ru: Ошибка в подсистеме вывода MP3: неправильный режим каналов '%1%'.

source: MP3 support backend
ru: Поддержка вывода MP3

source: Null output backend
ru: Поддержка NULL-вывода

source: Error in OGG backend: code %1%.
ru: Ошибка в подсистеме вывода OGG: код %1%.

source: OGG backend error: invalid mode '%1%'.
ru: Ошибка в подсистеме вывода OGG: неправильный режим '%1%'.

source: OGG backend error: bitrate (%1%) is out of range (%2%..%3%).
ru: Ошибка в подсистеме вывода OGG: битрейт (%1%) превышает допустимые значения (%2%..%3%).

source: OGG backend error: quality (%1%) is out of range (%2%..%3%).
ru: Ошибка в подсистеме вывода OGG: уровень качества (%1%) превышает допустимые значения (%2%..%3%).

source: OGG support backend
ru: Поддержка вывода OGG

source: Error in OSS backend while working with device '%1%': %2%.
ru: Ошибка при работе с OSS устройством '%1%': %2%.

source: No suitable formats supported by OSS.
ru: Ни один подходящий формат вывода звука не поддерживается подсистемой OSS.

source: OSS sound system backend
ru: Поддержка подсистемы OSS

source: SDL backend error: buffers count (%1%) is out of range (%2%..%3%).
ru: Ошибка в подсистеме SDL: число буферов (%1%) превысило допустимые значения (%2%..%3%).

source: Error in SDL backend: %1%.
ru: Ошибка в подсистеме SDL: %1%.

source: Unknown error in SDL backend.
ru: Неизвестная ошибка в подсистеме SDL.

source: SDL support backend
ru: Поддержка подсистемы SDL

source: Failed to get volume in invalid state.
ru: Ошибка получения уровня громкости.

source: Failed to set volume in invalid state.
ru: Ошибка установки уровня громкости.

source: WAV support backend
ru: Поддержка вывода WAV

source: WAV conversion is not supported on non-seekable streams.
ru: Конверсия в WAV не поддерживается для непозиционируемых потоков.

source: Error in Win32 backend: code %1%.
ru: Ошибка в подсистеме Win32: код %1%.

source: Error in Win32 backend: %1%.
ru: Ошибка в подсистеме Win32: %1%.

source: Win32 backend error: buffers count (%1%) is out of range (%2%..%3%).
ru: Ошибка в подсистеме Win32: число буферов (%1%) превысило допустимые значения (%2%..%3%).

source: Win32 sound system backend
ru: Поддержка подистемы Win32

source: Specified filter order (%1%) is out of range (%2%...%3%).
ru: Уровень фильтрации (%1%) превысил допустимые значения (%2%...%3%).

source: Specified filter high cutoff frequency (%1%Hz) is out of range (%2%...%3%Hz).
ru: Верхняя частота среза фильтра (%1%Гц) превысила допустимые значения (%2%...%3%Гц).

source: Specified filter low cutoff frequency (%1%Hz) is out of range (%2%...%3%Hz).
ru: Нижняя частота среза фильтра (%1%Гц) превысила допустимые значения (%2%...%3%Гц).

source: Failed to set mixer matrix: invalid channels count specified.
ru: Ошибка установки микширования: неправильное число каналов.

source: Failed to set mixer matrix: gain is out of range.
ru: Ошибка установки микширования: превышение допустимого значения уровня.

source: Failed to create unsupported mixer with %1% channels.
ru: Ошибка создания микшера с неподдерживаемым (%1%) числом каналов.
